In [2]:
# One Way ANOVA Test is Best Suitable test to check the varaince among 4 Samples

# ASSUMPTIONS:

# H0 (NULL HYPOTHESIS): There is no difference in the average Turn Around Time (TAT) among 4 laboratories.  
# H0 : μ1 = μ2 = μ3 = μ4

# H1 (ALTERNATIVE HYPOTHESIS): There is a significance difference in the average Turn Around Time (TAT) among 4 laboratories.
# H1: μ1 ≠ μ2 ≠ μ3 ≠ μ4

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv(r"C:\Users\aravi\OneDrive\Desktop\ExcelR Assignments\03. Hypothesis Testing\LabTAT.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory_1  120 non-null    float64
 1   Laboratory_2  120 non-null    float64
 2   Laboratory_3  120 non-null    float64
 3   Laboratory_4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

In [5]:
df.head()

   Laboratory_1  Laboratory_2  Laboratory_3  Laboratory_4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [6]:
df.describe()

       Laboratory_1  Laboratory_2  Laboratory_3  Laboratory_4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [11]:
import scipy.stats as stats
F_Calculated,Pvalue=stats.f_oneway(df['Laboratory_1'], df['Laboratory_2'],df['Laboratory_3'], df['Laboratory_4'])
print(F_Calculated)
print(Pvalue)

118.70421654401437
2.1156708949992414e-57

In [14]:
# Comparing Pvalue with 5% level of significance
if Pvalue>0.05:
    print('Accept Null Hypothesis')
else:
    print('Reject Null Hypothesis')

Reject Null Hypothesis

# Hence There is a significance difference in the average Turn Around Time (TAT) among 4 laboratories